driver-tests/pojose/thrtlng/caThrottle/src/jbiasa/caThrottle.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="caThrottle"
             xmlns:tns="caThrottle" xmlns:ns="http://tst.sun.com/POJOThrottler/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://tst.sun.com/POJOThrottler/" location="../jbiServiceUnits/jseThrottle/com/sun/tst/POJOThrottler.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:POJOThrottlerInterface">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="POJOThrottlerOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="caThrottle"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="caThrottle"/>
            </output>
        </operation>
    </binding>
    <service name="casaService1">
        <port name="pojoThrottleSvc" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/casaService1/pojoThrottleSvc"/>
        </port>
    </service>
</definitions>

