driver-tests/pojose/thrtlng/caThrottle/test/testThrottlingConcurrent5/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cat="caThrottle">
  <soapenv:Body>
    <cat:POJOThrottlerOperation>
      <part1>TestThrottle</part1>
    </cat:POJOThrottlerOperation>
  </soapenv:Body>
</soapenv:Envelope>